Repository: mtermos/child_milestone
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Welcome
ar: أهلا وسهلا

source: to Child Milestone
ar: إلى تطبيق متابعة الأطفال

source: Get Started
ar: إبدأ الآن

source: Add Child
ar: إضافة طفل

source: Edit Child
ar: تعديل طفل

source: Add Photo
ar: إضافة صورة

# childsNameField
source: Child's Name
ar: اسم الطفل

# dateOfBirthField
source: Date of Birth
ar: تاريخ الميلاد

# pregnancyDurationField
source: Duration of Pregnancy (in weeks)
ar: مدة الحمل (بالأسابيع)

# genderField
source: Gender:
ar: الجنس:

source: Male
ar: ذكر

source: Female
ar: أنثى

# childsIdField
source: Child's ID
ar: رقم الطفل

# enterAllFieldsSnackBar
source: Enter all the fields!
ar: ادخل جميع الحقول!

# childsIdExistsSnackBar
source: Child ID already exists
ar: رقم الطفل موجود مسبقا

source: Cancel
ar: إلغاء

source: months old!
ar: شهراً!

source: Milestone checklist
ar: قائمة المتابعات

source: Notifications
ar: إشعارات

# tipsAndActivities
source: Tips & Activities
ar: النصائح والأنشطة

source: Home
ar: الرئيسية

source: Tips
ar: نصائح

source: App Rate
ar: تقييم التطبيق

# invalidEmailAlert
source: type a valid email
ar: اكتب بريدًا إلكترونيًا صالحًا

source: Username
ar: اسم المستخدم

source: Password
ar: كلمة المرور

# forgotPassword
source: Forgot your password?
ar: هل نسيت كلمة المرور؟

# noAccount
source: Don't Have an Account? Sign up
ar: ليس لديك حساب؟ قم بالتسجيل

# loginLabel
source: LOGIN
ar: تسجيل الدخول

source: Yes
ar: نعم

source: No
ar: كلا

source: Maybe
ar: ربما

source: Movement
ar: الحركة

source: Perception
ar: الادراك

source: Communication
ar: التواصل

source: Interaction
ar: التفاعل

source: Just Now
ar: الآن

source: Yesterday,
ar: البارحة,

# settingsCap
source: SETTINGS
ar: الاعدادات

source: Go Back
ar: العودة

# tipsRate
source: How you find the given tips?
ar: ما هو تقييمكم للنصائح المعطاة؟

# selectChild
source: select a child
ar: اختر طفلا

source: Child Summary
ar: ملخص متابعة الطفل

source: Log out
ar: تسجيل خروج

# newPeriodNotificationTitle
source: New Stage
ar: مرحلة جديدة

# newPeriodNotificationBody1male
source: The child
ar: الطفل

# newPeriodNotificationBody1female
source: The child
ar: الطفلة

# newPeriodNotificationBody2male
source: is now in a new stage, please enter the answers of this new stage
ar: دخل في مرحلة عمرية جديدة نرجو منكم الاجابة على الأسئلة الجديدة لهذه المرحلة

# newPeriodNotificationBody2female
source: is now in a new stage, please enter the answers of this new stage
ar: دخلت في مرحلة عمرية جديدة نرجو منكم الاجابة على الأسئلة الجديدة لهذه المرحلة

# weeklyNotificationTitle
source: Remainder, answer all the questions
ar: تذكير، اكمل جميع المتابعات

# weeklyNotificationBody1male
source: The milestone checklist of the child
ar: لم يتم إكمال المتابعات للطفل

# weeklyNotificationBody1female
source: The milestone checklist of the child
ar: لم يتم إكمال المتابعات للطفلة

# weeklyNotificationBody2
source: is not completed, please answer the remaining questions
ar: . نرجو إكمال المتبقي منها

source: Home Page
ar: الصفحة الرئيسية

# enterDecision
source: Enter your answer to this milestone
ar: إجابة جديدة

# updateDecision
source: Change your answer to this milestone
ar: غير إجابتك

# unansweredTitle
source: The unanswered milestones
ar: المتابعات التي لم يتم الاجابة عنها، من هذه المرحلة العمرية والمراحل السابقة

# yesTitle
source: Milestones answered YES
ar: المتابعات التي تم الاجابة عنها بنعم، من هذه المرحلة العمرية والمراحل السابقة

# noTitle
source: Milestones answered NO
ar: المتابعات التي تم الاجابة عنها بكلا، من هذه المرحلة العمرية والمراحل السابقة

# maybeTitle
source: Milestones answered MAYBE
ar: المتابعات التي تم الاجابة عنها بربما، من هذه المرحلة العمرية والمراحل السابقة

source: Rate
ar: تقييم

# ratingSuccessTitle
source: Thank you for rating the app
ar: شكراً لكم على تقييم التطبيق

# ratingSuccessDesc
source: Your rating of this application helps us to make it even better and encourages us to provide the best
ar: تقييمكم لهذا التطبيق يساعدنا على تطويره ويشجعنا لتقديم الأفضل

# appInterfaceRating
source: How to rate the app interface?
ar: ما هو تقييمكم لشكل التطبيق؟

# contentRating
source: How do you rate the content?
ar: ما هو تقييمكم لمحتوى التطبيق؟

# educationalContentRating
source: How do you rate the educational conent of the app?
ar: ما هو تقييمكم للمحتوى التعليمي للتطبيق؟

# areYouSureDelete
source: Are you sure?
ar: هل أنت متأكد من الحذف؟

# deleteForever
source: After deleting the information, it can't be restored.
ar: بعد حذف سجل هذا الطفل، لا يمكن استعادة المعلومات.

source: Child's Name
ar: اسم الطفل

# clickToWatchOn
source: Click here to watch in
ar: اضغط هنا لمشاهدة الفيديو عبر

# clickToWatchVideo
source: Click to watch assistative video
ar: اضغط لمشاهدة الفيديو المساعد

# clickToOpenDocument
source: Click to read document
ar: اضغط لقراءة المستند المساعد

source: Select Language
ar: اختار اللغة
